export const withdrawalReasonsList = [
  "서비스를 더 이상 이용하지 않아요",
  "오류가 너무 자주 발생해요",
  "원하는 매칭 상대를 찾지 못했어요",
  "고객센터 응답이 너무 느려요",
  "원하는 키워드의 게시물이 올라오지 않아요",
  "부적절한 게시물/댓글이 많아요",
  "일시적인 탈퇴에요, 나중에 다시 올 예정이에요",
  "불쾌한 경험을 했어요",
];
export const deletedItemsList = [
  "프로필 사진, 닉네임, 평점 등 설정한 프로필 정보",
  "게시물, 댓글, 찜 리스트 등 작성자 정보",
  "설정한 관심 키워드, 나의 키워드",
  "이름, 성별, 전화번호 등 기타 개인정보",
];
export const withdrawalCautionList = [
  "닉네임, IP주소, 이용 기록 등은 악용 방지를 위해 6개월동안 보관돼요",
  "회원님이 남긴 글과 댓글의 작성자 정보는 ‘탈퇴회원'으로 노출돼요",
];
