import { SyntheticEvent } from "react";

import { classNames } from "@shared/utils/classNames";

type AvatarProps = {
  imageUrl: string | null;
  size?: number;
};

function Avatar({ imageUrl, size = 50 }: AvatarProps) {
  const handleError = (e: SyntheticEvent<HTMLImageElement>) => {
    // 이미지 로딩 에러난 경우 svg 보여주도록
    e.currentTarget.style.display = "none";
    e.currentTarget.nextElementSibling?.classList.remove("hidden");
  };

  return (
    <div>
      {imageUrl && (
        <img
          className={"aspect-square rounded-full"}
          src={imageUrl}
          alt={"아바타 이미지"}
          width={size}
          onError={handleError}
        />
      )}
      <svg
        className={classNames(imageUrl && "hidden")}
        width={size}
        height={size}
        viewBox="0 0 50 50"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <g clipPath="url(#clip0_6760_100310)">
          <rect width="50" height="50" rx="25" fill="#DEE1E3" />
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M42.9999 42.352C38.4527 47.0686 32.0689 50.0026 24.9999 50.0026C17.9309 50.0026 11.5472 47.0686 6.99997 42.352C7.01267 35.9452 10.3422 30.3137 15.3161 27.0931C14.1528 24.4831 13.351 21.4778 13.0523 18.2352C12.8794 16.3529 12.8794 14.518 13.0523 12.7622C13.1467 11.8448 13.4925 10.9749 14.0427 10.2789C15.2218 8.76038 17.3755 8.57056 18.806 9.83598C19.4663 10.437 19.9694 11.2121 20.2209 12.0979C20.7082 13.7904 21.0541 15.5936 21.227 17.4759C21.4628 20.0067 21.3685 22.4427 21.0069 24.7046C22.2803 24.4199 23.6165 24.2617 24.9842 24.2617C25.6759 24.2617 26.3519 24.2933 27.0122 24.3724C27.4838 22.6008 28.1755 20.8134 29.0873 19.0419C29.8733 17.5234 30.7851 16.1314 31.7598 14.8818C32.2785 14.2333 32.9702 13.7588 33.7248 13.4899C35.3598 12.9204 37.089 13.822 37.5606 15.4987C37.7807 16.2738 37.7807 17.1121 37.5449 17.9188C37.089 19.4373 36.4602 20.9874 35.6742 22.5059C34.951 23.8821 34.1493 25.1475 33.2846 26.3022C39.044 29.3181 42.9861 35.3761 42.9999 42.352Z"
            fill="white"
          />
          <path
            d="M20.5 38C21.0523 38 21.5 37.5523 21.5 37C21.5 36.4477 21.0523 36 20.5 36C19.9477 36 19.5 36.4477 19.5 37C19.5 37.5523 19.9477 38 20.5 38Z"
            fill="#C1C8CC"
          />
          <path
            d="M29.5 38C30.0523 38 30.5 37.5523 30.5 37C30.5 36.4477 30.0523 36 29.5 36C28.9477 36 28.5 36.4477 28.5 37C28.5 37.5523 28.9477 38 29.5 38Z"
            fill="#C1C8CC"
          />
          <path
            d="M24.9988 38.5L25.4083 38.5097C25.8623 38.5193 26.1427 38.998 25.9246 39.3026L25.7332 39.5733C25.7332 39.5733 25.7288 39.5782 25.7243 39.583L25.6442 39.6845C25.3015 40.1052 24.6961 40.1052 24.3534 39.6845L24.2733 39.583C24.2733 39.583 24.2688 39.5782 24.2644 39.5733L24.073 39.3026C23.8593 38.998 24.1398 38.5193 24.5893 38.5097L24.9988 38.5Z"
            fill="#C1C8CC"
          />
        </g>
        <defs>
          <clipPath id="clip0_6760_100310">
            <rect width="50" height="50" rx="25" fill="white" />
          </clipPath>
        </defs>
      </svg>
    </div>
  );
}

export { Avatar };
